src/InformationRegisters/Хроника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Хроника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийХроники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/Хроника/Ext/Module.bsl
// Общая история событий (ADR-003).
// Регистр Хроника — производные данные: источник истины — документы и справочники модулей.
// Пишет в регистр только этот модуль, в транзакции записи источника.

#Область ПрограммныйИнтерфейс

// Создаёт описание события для ДобавитьЗапись.
//
// Параметры:
//  ТипСобытия - ПеречислениеСсылка.ТипыСобытийХроники
//  Заголовок - Строка - текст для пользователя: «Заменили картридж фильтра».
//  Дата - Дата - по умолчанию текущая дата сеанса.
//
// Возвращаемое значение:
//  Структура:
//   * Дата - Дата
//   * ТипСобытия - ПеречислениеСсылка.ТипыСобытийХроники
//   * Заголовок - Строка
//   * Описание - Строка
//   * Сумма - Число
//   * Валюта - Строка
//
Функция НовоеСобытие(ТипСобытия, Заголовок, Дата = Неопределено) Экспорт

	Событие = Новый Структура;
	Событие.Вставить("Дата", ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Событие.Вставить("ТипСобытия", ТипСобытия);
	Событие.Вставить("Заголовок", Заголовок);
	Событие.Вставить("Описание", "");
	Событие.Вставить("Сумма", 0);
	Событие.Вставить("Валюта", "");
	Возврат Событие;

КонецФункции

// Добавляет событие в историю.
//
// Параметры:
//  Событие - см. НовоеСобытие
//
// Возвращаемое значение:
//  УникальныйИдентификатор - идентификатор записи.
//
Функция ДобавитьЗапись(Событие) Экспорт

	Запись = РегистрыСведений.Хроника.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Новый УникальныйИдентификатор;
	ЗаполнитьЗначенияСвойств(Запись, Событие);
	Запись.Записать();
	Возврат Запись.Идентификатор;

КонецФункции

// Удаляет все записи истории и строит их заново из источников.
// Вызывается после восстановления из резервной копии и после миграций, меняющих источники.
// Источники подключаются по мере появления модулей (Фаза 1 и далее): каждый модуль отдаёт
// свои события функцией СобытияДляХроники().
//
Процедура Перестроить() Экспорт

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.Хроника");
		Блокировка.Заблокировать();

		Набор = РегистрыСведений.Хроника.СоздатьНаборЗаписей();
		Набор.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
